# -*- coding: utf-8 -*-

#/Users/imeva/Documents/GitHub/nelly-ass/



info = 'lessons/info.pdf'
sticker_funny = 'stickers/funny.webp'
url_zoom = "https://us04web.zoom.us/j/3064665128?pwd=bTY1SDhpTkZMcC9KQXNEcXVYeDJTQT09"


hello ='''
Привет!)

Спасибо за покупку курса!
Это твой первый шаг на пути к классной ленте ♥️

С информацией о курсе и его расписанием можно ознакомиться, нажав на соотвествующие кнопки ниже.

Обязательно вступай в чат курса — там можно будет общаться с однокурсниками, задавать вопросы, обсуждать задания и делиться своими идеями✨
'''



datatable = '''
📌 02.08.21 — УРОК 1. Введение. Основные правила мобильной фотографии.
📌 05.08.21 — УРОК 2. Типы фото: портреты и позирование, раскладки, текстуры, детали, пейзажи.
📌 09.08.21 — УРОК 3. Цветовые сочетания.
📌 12.08.21 — УРОК 4. Черновая обработка.
📌 16.08.21 — УРОК 5. Чистовая обработка.
📌 19.08.21 — УРОК 6. Бриф и ТЗ. Вайб и ассоциации. Составление мудборда.
📌 21.08.21 — УРОК 7. Концепция. Выбор фото. Правила составления ленты.
📌 26.08.21 — УРОК 8. Подбор референсов. Одежда и локация.
📌 30.08.21 — Подведение итогов. Разбор полетов.
'''


melted ='''
Курс состоит из 8 уроков, которые будут проходить в Zoom — совсем
как на дистанционке в универе) Уроки будут выходит дважды в неделю согласно расписанию — его
ты можешь посмотреть в боте. Каждый длится примерно 30 минут, а после урока в боте будет
запись и конспект.

Также после каждого урока будет домашнее задание (ДЗ) — его
необходимо выполнить в течение 3 дней и отправить в бот. Я проверю
и дам комментарии.

ДЗ можно исправить с учетом моих
комментариев и прислать на повторную проверку. В общей сложности
на выполнение и исправление ДЗ у тебя есть 72 часа.

Помимо ДЗ я буду так же скидывать креативные задания (КЗ). Это
задания со звездочкой, для отличников и отличниц. Делать их
необязательно, но выполнив их, ты сможешь прокачать свою
креативность и навыки мобильной фотографии. По этим заданиям я
тоже буду давать комментарии, если получу их в течение 3 дней с
момента выдачи.

Еще один этап проверки твоих знаний — это тесты на
насмотренность. С ними ты выработаешь вкус и научишься
отличать крутые фото от посредственных, а актуальные — от
устаревших.

За каждое задание будут начисляться баллы по десятибалльной
шкале. Чем больше баллов, тем лучше, ведь самого
старательного студента в конце курса ждет подарок!
'''

the_end = '''
ПОДВЕДЕНИЕ ИТОГОВ:
— посмотрим, к каким результатам мы пришли;
— поговорим о курсе — что понравилось, а что нет;
— узнаем, кто набрал максимум баллов и выиграл подарок ♥️
'''

admin_sent_message = '''
AllBot_Test_Message
'''


lesson_1 = {
'access' : 2,
'topic' : 'Введение. Основные правила мобильной фотографии.',
'lesson' : 'lessons/Lesson_1.pdf',
'homework' : 'lessons/Homework_1.pdf',
'create_work' : 'lessons/Creative_HW_1.pdf',
'test' : 'https://docs.google.com/forms/d/1Lzjr-t3qtP6MzCpxaFpqGNLbo_3IFB1Oo9JPeezy6Pk/edit',
'url_lesson' : 'https://drive.google.com/file/d/1FQ2bqNLILGYELzZr4QSNWfe2uBXEnNnU/view?usp=drivesdk',
}

lesson_2 = {
"access" : 1,
'topic' : 'Типы фото: портреты и позирование, раскладки, текстуры, детали, пейзажи.',
'lesson' : 'lessons/Lesson_2.pdf',
'homework' : 'lessons/Homework_2.pdf',
'create_work' : 'lessons/Creative_HW_2.pdf',
'test' : 'https://forms.gle/tdGSpsLBXyUY5oddA',
'url_lesson' : 'https://drive.google.com/file/d/1FQ2bqNLILGYELzZr4QSNWfe2uBXEnNnU/view?usp=drivesdk',
}

lesson_3 = {
"access" : 0,
'topic' : 'Цветовые сочетания.',
'lesson' : 'lessons/Lesson_2.pdf',
'homework' : 'lessons/Homework_2.pdf',
'create_work' : 'lessons/Creative_HW_2.pdf',
'test' : 'https://forms.gle/tdGSpsLBXyUY5oddA',
'url_lesson' : 'https://drive.google.com/file/d/1FQ2bqNLILGYELzZr4QSNWfe2uBXEnNnU/view?usp=drivesdk',
}
